[{"title": "Gaza receives first airdrop of US humanitarian aid", "link": "https://www.bbc.co.uk/news/world-middle-east-68457937            ", "text": "Israel-Gaza war: US carries out first aid airdrop in strip\n- Published\nThe US has carried out its first airdrop of humanitarian aid for Gaza, with more than 30,000 meals parachuted in by three military planes.\nThe operation, carried out jointly with Jordan's air force, was the first of many announced by President Joe Biden.\nHe promised to step up aid after at least 112 people were killed as crowds rushed a convoy on Thursday.\nThe airdrop comes as a top US official said the framework of a deal for a six-week ceasefire in Gaza was in place.\nOn Saturday C-130 transport planes dropped more than 38,000 meals along the coastline of the territory, US Central Command said in a statement.\n\"These airdrops are part of a sustained effort to get more aid into Gaza, including by expanding the flow of aid through land corridors and routes,\" it added.\nOther countries including the UK, France, Egypt and Jordan have previously airdropped aid into Gaza, but this is the first by the US.\nAdministration officials said that Thursday's \"tragic incident\" had highlighted \"the importance of expanding and sustaining the flow of humanitarian assistance into Gaza in response to the dire humanitarian situation\".\nAid agencies have said that airdrops are an inefficient way of delivering aid.\nDisplaced Gaza resident Medhat Taher told Reuters news agency that such a method was woefully inadequate.\n\"Will this be enough for a school? Is this enough for 10,000 people?\" he said. \"It's better to send aid via crossings and better than airdropping via parachutes.\"\nIn his statement on Friday, President Biden said the US would \"insist that Israel facilitate more trucks and more routes to get more and more people the help they need\".\nMeanwhile a Biden administration official said on Saturday that Israel had \"more or less accepted\" a deal on a new ceasefire.\n\"It will be a six-week ceasefire in Gaza starting today if Hamas agrees to release the defined category of vulnerable hostages (...) the sick, the wounded, elderly and women,\" the unnamed official said.\nUS Vice-President Kamala Harris will meet Israeli war cabinet member Benny Gantz in Washington on Monday to discuss a truce and other issues, Reuters quotes a White House official as saying.\nIn Thursday's incident, 112 people were killed and more than 760 injured as they crowded around aid lorries on the south-western edge of Gaza City.\nHamas accused Israel of firing at civilians, but Israel said most died in a crush after it fired warning shots.\nGiorgios Petropoulos, head of the Gaza sub-office of the UN Co-ordinator for Humanitarian Affairs (OCHA) told the BBC that he and a team sent to al-Shifa hospital had found a large number of people with bullet wounds.\nHamas meanwhile said an Israeli bombardment had killed at least 11 people at a camp in Rafah in southern Gaza on Saturday. World Health Organization chief Tedros Adhanom Ghebreyesus called the attack \"outrageous\". The Israeli army said it had carried out a \"precision strike\" against Islamic Jihad militants in the area.\nThe UN's World Food Programme has warned that a famine is imminent in northern Gaza, which has received very little aid in recent weeks, and where an estimated 300,000 people are living with little food or clean water.\nThe Israel military launched a large-scale air and ground campaign to destroy Hamas after its gunmen killed about 1,200 people in southern Israel on 7 October and took 253 back to Gaza as hostages.\nGaza's Hamas-run health ministry says more than 30,000 people, including 21,000 children and women, have been killed in Gaza since then with some 7,000 missing and at least 70,450 injured.", "summary": "The US conducts its first airdrop of humanitarian aid into Gaza, with over 30,000 meals dropped by three military planes as a joint effort with Jordan's air force, following President Biden's promise to increase aid following the deaths of 112 individuals in a convoy stampede. A deal for a six-week ceasefire in Gaza appears to be in place, with Saturday's airdrop comprising over 38,000 meals along the territory's coastline as part of a larger effort to boost aid flow. While other nations have conducted airdrops in Gaza before, the US's airdrop marks its first. Aiming to relieve the dire humanitarian situation, the administration emphasises the importance of expanding aid channels into Gaza. Displaced resident Medhat Taher criticises the airdrop method as insufficient, advocating for aid delivery through crossings, as President Biden urges Israel to enhance aid distribution routes. An unnamed US official reveals that Israel has tentatively agreed to a new ceasefire alongside demands for the release of vulnerable hostages. The World Food Programme warns of an impending famine in northern Gaza due to insufficient aid, with over 30,000 casualties and numerous missing persons reported in the ongoing conflict between Israel and Hamas.", "guardian_link": "https://www.theguardian.com/world/live/2024/mar/02/middle-east-crisis-israel-gaza-latest-news-updates-live      "}, {"title": "Fergal Keane: Aid convoy tragedy shows fear of starvation haunts Gaza", "link": "https://www.bbc.co.uk/news/world-middle-east-68456718            ", "text": "Fergal Keane: Aid convoy tragedy shows fear of starvation haunts Gaza\n- Published\nAfter the events at al-Rashid Street in Gaza, in which more than 100 people were reported killed after a rush on an aid convoy, the international community is under pressure to tackle the growing crisis of hunger in the territory, as Fergal Keane reports from Jerusalem.\nThey die in all kinds of places and ways. Broken under the rubble of their homes, blasted by explosives, punctured by high velocity bullets, cut open by flying shards of metal.\nAnd now - as the war enters its fifth month - death from hunger has come to haunt Gaza.\nIt is essential to know the when, what and how of the tragedy at al-Rashid Street.\nAlthough the precise facts require an independent investigation of a kind not likely in Gaza under current conditions, that should not distract from trying to answer why people risked their lives to gather in the pre-dawn darkness in the middle of a war zone.\nThe refugees were there because they were desperate to feed their families. They died by bullets and trampling - we do not yet know in what proportion - simply because they wanted to live. That is a cruel irony.\nEighty-five per cent of the population of Gaza is now displaced. The war has dismantled all normal economic activity and food supplies. Water and electricity supplies have been disrupted. Hospitals struggle without adequate medicine or power.\nFor the last week the UN - citing concerns over security - has said it is unable to deliver aid to northern Gaza. These are fundamental facts to bear in mind when trying to understand the tragedy.\nFrom the outset the international community - expressed in public statements - has regarded Israel as having the primary responsibility for ensuring aid can be delivered safely.\nBut, after months of war there is no sign of what the UN calls \"an enabling environment\" in which large volumes of aid can be delivered to those who need it.\nIt is not as if there has been absence of evidence of a mounting humanitarian crisis. Witness the statements made by the UN over several months.\n\"We are already seeing a cascading collapse in water, sewage, and sanitation services, telecoms, food shortages, and healthcare,\" the UN's Human Rights office reported on 15 November.\nOn 2 December, the Office for the Co-ordination of Humanitarian Affairs reported: \"UN humanitarians on Monday said that aid teams had only 'extremely limited' movement and access to the north was \"now entirely blocked.\"\nTwelve days later the UN Security Council adopted Resolution 2720 calling on \"the parties to the conflict to allow, facilitate and enable the immediate, safe and unhindered delivery of humanitarian assistance at scale directly to Palestinian civilians throughout that territory.\"\nOn 26 January, the International Court of Justice (ICJ) required Israel \"take immediate and effective measures to enable the provision of urgently needed basic services and humanitarian assistance.\"\nBy 9 February, director of the UN Relief and Welfare Agency (UNRWA) Phillipe Lazzarini was accusing Israel of blocking food for 1.1 million Palestinians in Gaza.\nAccording to the UN, 500 lorries of aid are required each day. The daily average has been 90.\nThe aid falling by parachute from the skies in recent days is welcomed on the ground, but it is also a symbol of the failure of the aid effort.\nThere are roads leading into Gaza from Israel and Egypt along which lorries carrying huge amounts of aid could travel - if those roads were safe.\nThe continuing war, and the chaotic conditions it has spawned, mean many lorry drivers will not risk their lives.\nCivilians looting aid, and criminal gangs stealing aid to sell, are part of what one UN official termed the \"Mogadishu-like\" conditions that may be developing - a reference to the chaos that enveloped the Somali capital during the civil conflict of the early 1990s.\nThe Hamas-run police force in Gaza is unwilling to escort aid convoys because its members reportedly fear being shot by the Israelis.\nAs for Hamas's leaders, having provoked this war they have vanished and are now fighting to survive in the tunnels and ruins of Gaza.\nIsrael says it is facilitating aid delivery and that, for example, there were three escorted deliveries on the nights prior to the tragedy at al-Rashid street. It has blamed the UN saying aid is stacked up inside the northern border and the UN hasn't \"turned up\" to distribute the supplies.\nIt is also deeply mistrustful of UNRWA - accusing the agency of being infiltrated by Hamas.\nIn the wake of the allegations UNRWA sacked 12 employees accused of either being involved in the 7 October attacks in Israel or helping in the detention of hostages.\nIsrael's Defence Minister Yoav Gallant said the IDF would no longer deal with the agency. \"UNRWA has lost legitimacy,\" he said, \"and can no longer function as a UN body.\"\nAt the beginning of the conflict, days after Hamas killed more than 1,200 people in Israel and kidnapped 250 others, Mr Gallant ordered a complete blockade of the Gaza Strip.\n\"There will be no electricity, no food, no fuel, everything is closed… We are fighting human animals and we are acting accordingly,\" he said.\nThat position changed under US pressure with President Joe Biden announcing a deal on 19 October under which Israel and Egypt allowed aid into Gaza.\nSome supplies began to flow but there were still reports of growing hunger.\nThere were repeated entreaties from Western politicians including UK Foreign Secretary Lord Cameron.\nOn 9 January, he said he was worried Israel had \"taken action that might be in breach of international law\" - adding he wanted Israel to restore water supplies to Gaza.\nA month later - on 12 February - he told the UK's House of Lords that Israel had to make sure food, water and shelter were available to people in Gaza \"because if they don't do that, that would be a breach of international humanitarian law\".\nIn the wake of al-Rashid Street he called for an urgent investigation. \"This must not happen again,\" he said.\nBut the evidence from many civilians in Gaza is they live in constant fear of violent death and - increasingly - starvation.\nIn time the world will ask itself why the UN Security Council, comprising the most powerful nations on earth, did not ensure the delivery of life-saving aid to hundreds of thousands of desperate people in Gaza.\nThis after nearly eight decades of UN humanitarian operations around the world. There is no shortage of experience or resources.\nAddressing the Security Council a week before al-Rashid street incident, secretary general of aid organisation Medecins Sans Frontieres Christopher Lockyear spoke of a situation where \"the laws and the principles we collectively depend on to enable humanitarian assistance are now eroded to the point of becoming meaningless… the humanitarian response in Gaza today is an illusion.\"\nIt is still too early to speak of the tragic events of 29 February as a turning point.\nBut, the deaths of so many in such terrible circumstances have added to the growing pressure for a ceasefire deal that would allow food to reach the hungry.\nThe coming days will tell if those hopes can be realised.", "summary": "Fergal Keane reports on the tragic events at al-Rashid Street in Gaza, where over 100 people lost their lives during a rush on an aid convoy. The territory is facing a crisis of hunger as more residents die from various causes, including starvation. Despite ongoing conflicts and a dire humanitarian situation, aid delivery to Gaza remains a challenge, with the UN struggling to provide assistance to those in need due to security concerns. The international community holds Israel responsible for ensuring safe aid delivery, but logistical challenges and mistrust complicate efforts. Hamas's involvement in provoking the conflict adds to the complexities of aid distribution, with accusations of aid theft and political infiltration causing further obstacles. The UN and other humanitarian agencies face mounting pressure to address the escalating crisis and prevent future tragedies like the one at al-Rashid Street.", "guardian_link": "https://www.theguardian.com/world/live/2024/mar/02/middle-east-crisis-israel-gaza-latest-news-updates-live      "}, {"title": "Father wants cyber-bullying law after Mia's death", "link": "https://www.bbc.co.uk/news/uk-68456057            ", "text": "Mia Janin: Father wants cyber-bullying law after daughter's death\n- Published\nThe father of a girl who took her own life says cyber-bullying should be made a specific crime to protect children.\nMia Janin's parents had no idea she was being targeted on social media by pupils at her London school before she died in March 2021, aged 14.\nFather Mariano Janin told the BBC's Sunday with Laura Kuenssberg programme new laws were needed to tackle the issue affecting young people globally.\nHe said it was time to be \"more alert and I would like the system to work\".\nMia was found dead at her Harrow family home a day after returning to Jewish Free School (JFS) following the lifting of Covid lockdown restrictions.\nAfter her death, her parents began to piece together evidence that she was being bullied by a group of male students on social media and in person.\nIn a voice note sent to a friend the night before she died, Mia said: \"Tomorrow's going to be a rough day, I'm taking deep breaths in and out. I'm currently mentally preparing myself to get bullied tomorrow.\"\nIn the UK, there is no specific law on bullying or cyber-bullying and the courts rely on other legislation around harassment and malicious communications.\nSpeaking to the programme, Mr Janin said: \"I think we need to do something against bullying. We need to revise the existing legislation about bullying, try to understand and try to act, do something.\"\nHe continued: \"We need to transmit to our kids values, normal values, kindness, acceptance, understanding - then we need of course some kind of legal boundaries for social media.\"\nMr Janin has previously called for bereaved parents to be allowed more access to their children's social media accounts in order to aid efforts to trace how and why they died.\nHe told the BBC: \"I know there are still lots of young people suffering... in a good country, in a modern society, we shouldn't have our kids dying for this stupid matter or subject.\"\nLast month, Esther Ghey - whose daughter Brianna Ghey, 16, was murdered in February 2023- told the BBC she believed social media on smartphones should be banned for under-16s.\nAsked about that proposal, Mr Janin said: \"I understand her perfectly well because that was my feeling as well at the beginning - but it is like putting the genie inside the bottle again.\n\"We need to learn to live with this technology. This is happening globally, it is not only in England.\n\"I'm sitting here in London, probably at the same time we have another parent doing the same in Milano, another one in San Francisco, in Buenos Aires.\"\nMr Janin said he believed the new Online Safety Bill, which came into law in October 2023 and aims to improve child safety on the internet, could be a \"first step in order to get real change\".\nFour months after Mia's death, her mother Marisa died after suffering an aneurysm and contracting leukaemia.\nAsked how he had processed his loss, Mr Janin said: \"I think I can accept what happened, I don't think I will understand.\n\"I accept it has happened to me - I just live in an empty house with a small dog, I used to have a home with a wife and a daughter.\n\"I accept that is my reality. I cannot escape from this.\"\nMr Janin also told the BBC he had serious concerns about the way the investigation into the bullying of his daughter had been handled by the school after her death.\nIn response, a JFS spokesperson said: \"After Mia's tragic death, all information held by the school was handed to the Metropolitan Police to support their investigation.\n\"Throughout the investigation, the school has given open access to all of its systems. Our thoughts remain, as they have always been, with the family.\"\nEarlier this week, the coroner for North London issued a report to JFS urging its leaders to take further action on bullying to prevent future deaths, particularly the targeting of female pupils by males.\nWhile it acknowledged school policies had been overhauled, it said new initiatives \"do not appear to have gained the confidence of some JFS female students\".\nIn a later statement to the BBC, Mr Janin welcomed the coroner's intervention and said he remained \"concerned that the school has not, and is not, doing enough\".\nHe continued: \"The school, indeed all schools, need to take their responsibilities towards our children much more seriously.\n\"One death is a death too much. This culture of wilful ignorance needs to change and it needs to change now.\"\nIn response, a JFS spokesperson said the witness statements referred to by the coroner dated back as far as early 2021 and were \"not a reflection of the school today\".\nThey added Ofsted found in April 2022 that pupils at the school felt confident to report bullying concerns to staff.\nIf you've been affected by the issues raised in this report, the BBC Action Line has a list of organisations that may be able to help.", "summary": "Mia Janin's father, Mariano Janin, advocates for cyber-bullying laws after his daughter's tragic suicide following relentless bullying at her London school in March 2021. Mia's parents discovered evidence of bullying by male students on social media and in person after her death. The absence of specific legislation on bullying or cyber-bullying in the UK prompted Mr. Janin to call for legal revisions and more parental access to children's social media accounts to combat the issue. He stresses the importance of instilling values of kindness and acceptance in children while setting legal boundaries for social media. Mr. Janin supports the new Online Safety Bill as a potential catalyst for real change in addressing child safety online. Following Mia's death, her mother passed away, and Mr. Janin expresses acceptance of his new reality despite not fully understanding his losses. Concerned about the handling of the bullying investigation by the school, Mr. Janin urges schools to take bullying prevention more seriously to avoid similar tragedies, echoing the sentiments of the North London coroner's report urging JFS to address bullying towards female students.", "guardian_link": "https://www.theguardian.com/books/2024/mar/02/the-man-who-tricked-nazi-germany-lessons-from-the-past-on-how-to-beat-disinformation      "}, {"title": "Tories need a Budget bounce but can Hunt deliver?", "link": "https://www.bbc.co.uk/news/uk-politics-68456407            ", "text": "Laura Kuenssberg: Tories need a Budget bounce but can Jeremy Hunt deliver?\n- Published\nCut tax! Spend less! Spend more! Tax more! Pay off the debt! Spend more on defence! More for me! Less for you!\nChancellors are never short of demands from the outside world or their colleagues on the inside for action.\nAfter taking the reins during the Liz Truss disaster, nothing Jeremy Hunt says in his Budget on Wednesday is going to be as dramatic, or perhaps as important, as those first few decisions to ditch tens of billions of tax cuts that were promised on the never never.\nBut that doesn't mean the clamour calling on him to do this or that is any less deafening. The pressure is huge, especially when the general election is months, not years away.\nBe the first to sign up for the Off Air with Laura K newsletter, starting this week. Get Laura Kuenssberg's expert insight and insider stories every week, emailed directly to you.\nTalking to Jeremy Hunt's Conservative colleagues, there is one thing they desire more than anything else.\nTax cuts.\nThat's not just because the overall tax burden is at the highest it has been.\nBut because instinctively, ideologically, as one frustrated MP told me, \"it's a good Conservative principle\".\nThe MP told me the party has to \"offer the idea at least that things are getting better and you are going to keep more of your own money\".\nAnd another senior Conservative warns, unless there are \"meaty tax cuts\", it just won't be enough for the \"moderate right\" of the party who worry \"we just don't really look like a proper Conservative Party anymore\".\nIs that what the public wants?\nPolling gives different results depending how the question is asked (shock, horror).\nBut very often it suggests that many voters would rather money went to ease the strain on public services.\nOr, as voters, we're all greedy. One MP jokes: \"I think no one should pay any tax and we should spend more too.\"\n- On this week's show are Chancellor Jeremy Hunt, Labour'sShadow Education Secretary Bridget Phillipson and Mariano Janin, father of Mia Janin, who took her own life after being bullied at school\n- Watch live on BBC One and iPlayer from 09:00 GMT on Sunday\n- Follow latest updates in text and video on the BBC News website from 08:00\nThe Treasury does seem on track to cut National Insurance payments, although when Jeremy Hunt talks to us on Sunday morning, he won't confirm that yet.\nA National Insurance cut is seen by Number 10 and Number 11 - and this Budget is as much Rishi Sunak's as it is Jeremy Hunt's - as a quick way to reduce tax payments for millions, which is why Mr Hunt announced one in his autumn statement in November.\nWhether it really has a political effect is a different question.\nThe move in the autumn didn't budge the Tories' dreadful opinion poll numbers, or change the mood on the backbenches for more than a few metaphorical minutes.\nAnd that's the other demand from many Conservatives - to give them something that might change the political atmosphere.\nThe question one poses is: \"How do you make people feel better AND make Keir Starmer feel worse?\"\nThe answer to that is expected to be stealing one of Labour's own policies, by closing down the legal loopholes for \"non-doms\", wealthy individuals who avoid tax on money made overseas.\nHypothetically, such a move would raise a few billion that can be spent on something else, like that National Insurance cut.\nBut politically, the aim would be to put Labour into a tricky corner.\nIf the Tories have already changed the policy the money Labour had earmarked for extra NHS staff and breakfast clubs in schools will no longer be available.\nLabour will then need to come up with new ways of paying for those ideas at a time when public money is as tight as a drum.\nIf the Chancellor also extends the windfall tax on oil and gas companies as Labour plans to, then some of the money they have earmarked to spend on green jobs and green energy, if they win power, might be gobbled up too.\nAlthough, the precise details of any policy, if and when it is announced on Wednesday, will be hugely important.\nA Labour source said: \"'I think most punters at home will be asking themselves what is the point of the Conservatives now?\n\"This is the final Budget of their 14 years and four terms in office and what have they got left? Nothing more than stealing Labour's plan.\n\"This isn't a clever move on the chessboard. It is a sign of desperation from a chancellor who was sent out by Number 10 to say he was going to be the next Nigel Lawson [a tax-cutting Tory chancellor] only to find there is no money left.\"\nWhat is abundantly clear though, is that there isn't going to be more money splashing around this week.\nTreasury insiders are glum about the changes in the economy since the beginning of the year, that has made their cheque book smaller and smaller.\nThe last time Mr Hunt made a big set of announcements the picture in the medium term was already bleak enough, a series of what looks like eye-watering cuts in the years to come, which might be politically impossible.\nAs my colleague Faisal Islam, the BBC's economics editor, has set out the picture this week is not likely to be any prettier.\nSo you can also expect the chancellor to talk on Wednesday about spending taxpayers' cash better.\n\"Spend it better\" isn't exactly a grabby slogan, but it's got more appeal than \"sorry, I'm not raising tax any more and the economy is bleak so you'll have to make do\".\nOne former Treasury minister worries that no politician on the government side is being straight about how fragile things really are, telling me: \"If you were just thinking about the economics not the politics you would consolidate and get the debt down - you'd shore up the public finances, not use it for tax cuts, especially ones with dubious value.\"\nThe national debt is, indeed, absolutely enormous.\nThe cost of the pandemic and the shock of the Ukraine war have both been incredible.\nThere are long-term pressures from an ageing population, the demands for defence in a more dangerous world, and the cost of going green, which politicians argue over, but, in this country, just about all agree has to happen.\nAnd in the short term there are two more huge costs coming that the government will have to settle.\nThe cost of compensation for the Post Office Horizon scandal, which sources suggest could reach £3bn.\nAnd payouts to the victims of the infected blood scandal, which could tip £15bn.\nThere is zero guarantee the country's books are going to look any healthier in the autumn, when the general election is expected.\nIs there still a tiny chance the prime minister will wake up in a fortnight and think, well, it's not going to get any better, let's crack on with the election right now?\nNever say never.\nBut this Budget is not likely to give Rishi Sunak a bounce into a ballot in late spring.\nWe'll have to wait until Wednesday to see if it's going to give him and Jeremy Hunt any bounce at all.\nWhat questions would you like to ask Chancellor Jeremy Hunt and Labour's Shadow Education Secretary Bridget Phillipson this Sunday?\nIn some cases your question will be published, displaying your name, age and location as you provide it, unless you state otherwise. Your contact details will never be published. Please ensure you have read our terms & conditions and privacy policy.\nUse this form to ask your question:\nIf you are reading this page and can't see the form you will need to visit the mobile version of the BBC website to submit your question or send them via email to YourQuestions@bbc.co.uk. Please include your name, age and location with any question you send in.", "summary": "This article discusses the tension around the upcoming Budget and the pressure on Chancellor Jeremy Hunt to deliver a positive outcome for the Tories. There are various demands being made, including calls for tax cuts and increased spending on essential services. The Conservative Party is looking for ways to boost their image and win over voters, with suggestions of implementing policies to counteract Labour's plans. However, the economic challenges, such as the national debt and upcoming costly settlements, pose significant hurdles for the government. Despite the potential political strategies being considered, the overall economic outlook remains uncertain, leaving the question of whether the Budget will provide the desired bounce for the Tories unanswered.", "guardian_link": "https://www.theguardian.com/politics/2024/mar/02/tax-and-spending-cuts-will-backfire-economists-warn-jeremy-hunt      "}, {"title": "Brit Awards: Raye eyes record-breaking haul with four wins so far", "link": "https://www.bbc.co.uk/news/live/entertainment-arts-68428111            ", "text": "As we already knew before the ceremony, the award for Producer of the Year has gone to drum and bass duo Chase & Status.\nProducers Saul Milton (Chase) and Will Kennard (Status) are now walking onstage to get their award.\nAs we already knew before the ceremony, the award for Producer of the Year has gone to drum and bass duo Chase & Status.\nProducers Saul Milton (Chase) and Will Kennard (Status) are now walking onstage to get their award.\nTara Mewawalla\nLive reporter\nUp on the stage again - but this time to sing instead of to pick up another award - Raye is performing a medley of her songs.\nShe starts with Ice Cream Man. from her album My 21st Century Blues. The tear-jerker is fit with lyrics, like \"I'm a woman, a very... strong woman\", which we think appropriately captures the energy of an awards ceremony where over half the nominees are women.\nShe moves onto TikTok hit song Prada, moving away from her piano and as the momentum of the performance builds up she sings Escapism - the track that won her Best Song of the Year earlier - with an epic band accompanying her.\nMark Savage\nBBC Music correspondent\nboygenius just won international group of the year. They’re not exactly household names, but the indie-rock supergroup - made up of Phoebe Bridgers, Lucy Dacus and Julian Baker - made one of last year’s most critically acclaimed albums. Called The Record, it views the melodic, close harmony sounds of Californian rock through a queer, feminist lens.\nSongs like Not Strong Enough and Cool About It are quietly devastating at the same time as being massive, arena-filling singalongs. When they headlined their own mini-festival in London’s Gunnersbury Park last summer, they had to stop the show half a dozen times as people in the audience passed out (from a combination of heat and fluttering hearts).\nAfter winning multiple Grammys last month, it looks like they might go on hiatus to pursue their solo careers again. But if they keep going, the world is their oyster.\nAlso sending in a video message, the band members of boygenius thank their label, shaking the award at the camera and smiling.\nThe US indie supergroup consists of Julien Baker, Phoebe Bridgers, and Lucy Dacus.\nSo Raye has got three awards so far plus the Best Songwriter Award, which we already know she won, so she is tied for most amount of Brit awards ever.\nShe jointly holds it with Blur (1995), Adele (2016) and Harry Styles (2023).\nMark Savage\nBBC Music correspondent\nPerhaps so! Her victory in the Best Pop category comes in a relatively quiet year - she only released the Barbie song Dance The Night and her psychedelic pop single Houdini during the eligibility period.\nBut the British-Kosovan star is undoubtedly the UK’s biggest pop export right now - and with her third album on the way, she’s likely to be back big time at next year’s ceremony.\nReceiving a standing ovation, Dua Lipa skips onto the stage, saying her fans are the \"reason she's standing here today\" and thanks \"each and every one\".\n\"You guys give me this radical sense of confidence that I can do anything and that I can try and experiment.\"\nShe ends by thanking a whole list of people, including her producer, music team, the team at Warner Records and her \"incredible\" band and dancers.\nNominated for this award are:\nLeisha Chi-Santorelli\nBBC News Culture reporter\nCasIsDead has been on the music scene for quite a while, releasing his first track nearly 20 years ago, but is still considered a mysterious figure.\nFrom Tottenham in London, he is of Ghanaian and English descent. In previous years he has hidden his face behind a balaclava and then a variety of masks. He is also said to rarely give interviews to the press.\nAoife Walsh\nLive reporter at the Brit Awards\nMy eardrums are ringing after hearing the cheers when CasIsDead was announced as Best Rap and Grime winner. He thanked his fans, saying “without you lot none of this would have happened”.\nCasIsDead takes the stage, saying this is \"well funny\". He says there are too many people involved to thank everyone so he will thank each person \"privately\" later.\nHe adds that he is especially grateful to his fans.\nThis is Calvin Harris's third Brit Award. He dedicates his award to dedicate to Danny Rampling and thanks singer Ellie Goulding and his wife.\nHere are the nominees:\nMark Savage\nBBC Music correspondent\nSZA beating Taylor Swift to the international prize could definitely be considered an upset. Swift was was the biggest-selling artist of last year, quite apart from her record-shattering Eras tour and the huge cultural conversation around her love life and musical output.\nShe even triggered an earthquake at one of her concerts.\nBut SZA’s second album SOS clearly resonated more with the 1,300 Brits voters (Taylor Swift’s output last year was two re-recordings, of her albums Speak Now and 1989).\nA hugely articulate and emotional account of the ups and downs of post-millennial relationships, it scooped several Grammys earlier this year - and SZA herself gave a stunning, Grand Guignol performance of the standout single Kill Bill.\nAs important as Swift is to pop, SZA is to R&B. And for that alone, she’s a deserving winner.", "summary": "At the Brit Awards ceremony, the award for Producer of the Year was given to drum and bass duo Chase & Status, Saul Milton (Chase) and Will Kennard (Status), who walked onstage to receive their award. Raye performed a medley of her songs, including Ice Cream Man and Prada, before boygenius grabbed the international group of the year award, despite being lesser-known household names; their critically acclaimed album, The Record, has garnered attention through its unique perspective. Dua Lipa won the Best Pop category, expressing gratitude to her fans, producer, team, and supporters, while CasIsDead was hailed as the Best Rap and Grime winner, acknowledging his fans for their support. Calvin Harris won his third Brit Award, attributing his success to Danny Rampling, Ellie Goulding, and his wife, and SZA surprised by winning the international prize over Taylor Swift with her album SOS, highlighting the emotional nuances of modern relationships. Despite Swift's immense popularity, SZA's resonance with voters and impact on R&B solidified her deserving victory at the awards.", "guardian_link": "https://www.theguardian.com/music/live/2024/mar/02/brit-awards-2024-liveblog      "}, {"title": "Horner and wife Geri in display of unity at GP", "link": "https://www.bbc.co.uk/sport/formula1/68457915            ", "text": "Christian Horner: Red Bull team boss refuses to comment on leaked messages\n- Published\nRed Bull team boss Christian Horner has refused to say whether messages leaked this week are genuine.\nAn anonymous email including messages purporting to involve Horner were leaked a day after Red Bull dismissed a complaint of inappropriate behaviour against him.\nHorner said: \"I'm not going to comment on anonymous, speculative messages from an unknown source.\"\nHorner said he was confident he would be in his role for the entire season.\n\"I've always been entirely confident that I would be here,\" he said.\n\"There was a full, lengthy internal process that was completed by an independent KC. And the grievance that was raised was dismissed. End of. Move on.\"\nAn attempt to get him to say whether the messages were genuine was shut down by a Red Bull PR handler.\nRed Bull have refused to release the name of the lawyer involved or give any further details about the report that was compiled or how they reached their decision.\nHorner's wife Geri visited the Bahrain Grand Prix on Saturday in an apparent display of unity after the topic had dominated the days leading up to the race.\nGeri Horner, a member of pop group the Spice Girls, appeared with her husband, and they were later pictured kissing before the season opening race. Red Bull dominated on the track with champion Max Verstappen winning and team-mate Sergio Perez second.\nAlthough it was a pointed appearance with cameras present, is not uncommon for Geri to appear at a Grand Prix, and that she attends several races each year.\nChalerm Yoovidhya, head of the Thai family that co-owns Red Bull, was also at the race. Yoovidhya declined to answer BBC Sport's questions.\nAsked whether he was concerned that someone did not want the controversy surrounding the complaint against him to stop, Horner said: \"I'm not going to comment on what motives, whatever person may have for doing this.\n\"My focus is on this team, my family, my wife and going racing. I have the support of an incredible family, of an incredible wife, of an incredible team and everybody within that team and my focus is on going racing and winning races and doing the best that I can.\"\nF1's governing body the FIA said it was discussing the matter with commercial rights holder F1 Management.\nMercedes team boss Toto Wolff and McLaren Racing chief executive officer Zak Brown have both called for the FIA to look into the matter.\nWolff said: \"The handling of the situation is very critical for F1. It's not in the hands of competitors to have any action.\n\"We should look at ourselves, and what it is we can do to optimise on all these topics, equality and diversity. I am very proud we are at the forefront of that.\n\"To judge about a person in another team, it is the governing body that needs to judge. They have it in their hands and this is probably where we need to look.\n\"As a team, if we go beyond what we have said, it looks like it is battle between competitors in F1 and I don't want to reduce that topic to this level.\n\"It is a much wider issue that deserves more space and I don't want to harm the topic by making it an intra-team battle because it is not.\n\"It is the FIA or the legals who have to look at that. It is outside of the teams' control.\"\nTimeline of Horner allegations\n5 February: Red Bull announces investigation into Horner after complaint of inappropriate and controlling behaviour is made against him. Horner tells Dutch newspaper De Telegraaf:, external \"I completely deny these claims.\"\n11 February: Horner is interviewed by lawyer for several hours but hearing finishes without resolution.\n15 February: Red Bull launch car for 2024 F1 season and Horner tells the BBC the investigation is \"a distraction\" for his team.\n21 February: Mercedes team principal Toto Wolff calls for investigation to be transparent.\n28 February: Horner is cleared following internal investigation and Red Bull says he will remain in his role as team principal and chief executive.\n29 February: As first practice at the Bahrain Grand Prix begins, Horner tells Sky Sports unity within Red Bull team has never been stronger. Later that day, Horner reiterates his denial of allegations after a series of messages were leaked to F1 personnel and media.", "summary": "Team boss Christian Horner of Red Bull has avoided confirming the authenticity of leaked messages, following a complaint against him that was dismissed by the team. Despite speculation about his involvement in the leaked messages, Horner refrained from commenting on anonymous sources. Red Bull's PR team prevented any discussion on the credibility of the leaked messages, which has sparked controversy within the Formula 1 community. Horner maintained his position within the team, expressing faith in his role for the entire season, amidst calls from figures like Toto Wolff for transparency. The involvement of Horner's wife, Geri Horner of the Spice Girls, at the Bahrain Grand Prix seemed to emphasize solidarity in the face of the ongoing scrutiny. Additionally, the FIA has acknowledged discussions with F1 Management concerning the matter to address the broader issues at stake, emphasizing the importance of governing bodies in handling such situations in Formula 1.", "guardian_link": "https://www.theguardian.com/sport/2024/mar/02/red-bull-deliver-boost-for-beleaguered-boss-horner-with-bahrain-victory      "}, {"title": "Two women shot by gun dropped during moped pursuit", "link": "https://www.bbc.co.uk/news/uk-england-london-68457975            ", "text": "Clapham shooting: Two women hurt when gun dropped in moped pursuit\n- Published\nTwo women were shot when a gun fired after being dropped during a police pursuit of a moped.\nThe Metropolitan Police said officers were pursuing two people who failed to stop in Clapham at 16:55 GMT on Friday.\nThe moped also collided with a member of the public and crashed a short while later, the force said.\nAll three people have been released from hospital as police hunt the suspects whose \"reckless actions\" led to the gunshots.\nThe Met said it had established that the shotgun went off as it struck the ground, having been dropped while the suspects fled on foot.\nTwo women, aged 27 and 36, who had shotgun pellet injuries, were not deliberately targeted, police said.\nDet Ch Insp Gemma Alger said: \"Our investigation to identify the two people responsible is at an early stage, but we will be relentless in following up every line of enquiry to arrest them.\n\"The suspects fled the scene on foot. Crime scenes remain in place in St Alphonsus Road as forensic searches are ongoing at premises where the suspects made off through gardens.\n\"The shotgun was recovered from the scene and this will also be subject to forensic analysis.\"\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk", "summary": "Two women were shot in Clapham during a police pursuit of a moped, after a shotgun was dropped and fired. The Metropolitan Police were chasing two individuals who failed to stop in the incident. The moped collided with a member of the public before crashing further down the road. All three individuals involved have been released from the hospital, while police search for the suspects responsible for the gunshots. It was determined that the gun discharged when it hit the ground after being dropped by the suspects during their escape. The two injured women, aged 27 and 36, were not intentional targets of the shooting, according to authorities. Detectives are aggressively pursuing leads to apprehend those responsible, with crime scenes secured for forensic investigations at locations the suspects fled through. The recovered shotgun will undergo analysis as part of the ongoing investigation.", "guardian_link": "https://www.theguardian.com/uk-news/2024/mar/02/two-women-injured-south-london-suspect-dropped-firearm-say-police      "}]